#Дано натуральное число. Выведите его последнюю цифру.
a=int(input("введите число"))
b=print(a%10)
print("последняя цифра числа: ", b)
